'use strict';

//Ключевые вопросы

//1)Что может находиться внутри массива как его элементы?
//Любые сущности и типы данных

//2)Сколько аргументов может быть у функции?ъ
//Сколько угодно

//3)Что делает метод slice, примененный на строке?
//Метод slice извлекает часть строки и возвращает новую строку без изменения оригинала
 
//4)Для чего нужна система контроля версий?
//Для сохранения контрольных точек проета, чтоб в дальнейшем можно было откатить или вернуться
//Для организации командной работы
//Для сохранения резервов копий на уд. серверах, дабы другие разрабы могли их пользовать

//5)В чем отличие свойств от методов объектов?
//Свойства объектов подразумевают под собой наличие данных(строк, чисел, объектов и т.д.)
//Методы же это функции которые записаны в объекты

//6)Какой результат даст этот код?

// 0 || 1   |   false || true - Знак || возвращает true т.е. 1

// 0 && 1   |   false && true - Знак && возвращает false т.е. 0

// "a" > "b"    |   возвращает false

// 0 || NaN || false || null    |   возвращает null

//7)JavaScript - это...
//Прототипно-ориентированный язык программирования

//8)Конструкция switch позволяет...
//Объединить множество проверок и условий в удобном формате



